# GetParametersManager Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarContainer..::..GetParametersManager Method
RebarContainer Class See Also
---
Returns an object used to manage parameters of the Rebar Container.
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public RebarContainerParameterManager GetParametersManager()
```

Visual Basic
---
```text
Public Function GetParametersManager As RebarContainerParameterManager
```

Visual C++
---
```text
public:
RebarContainerParameterManager^ GetParametersManager()
```

# ### Return Value
The parameters manager.
# See Also
RebarContainer Class
Autodesk.Revit.DB.Structure Namespace